tap "homebrew/cask"
tap "sanemat/font"
tap "caskroom/fonts"
tap "adoptopenjdk/openjdk"

brew "bash-completion"
brew "fzf"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "wget"
brew "gnupg"
brew "gpg-agent"
brew "pinentry-mac"
brew "httpie"

# Terminal
cask "hyper"

# Editor
brew "neovim"
cask "jetbrains-toolbox"
cask "visual-studio-code"
mas "CotEditor", id: 1024640650

# Browser
cask "google-chrome"
cask "vivaldi"
cask "firefox"

# git
brew "git"
brew "tig"
brew "ghq"
brew "github/gh/gh"
cask "fork"

# Haskell
brew "haskell-stack"
brew "gmp"

# Python
brew "python"
brew "pyenv"
brew "pipenv"

# node
brew "node"
brew "nodenv"
brew "yarn", link: false

# Ruby
brew "ruby"
brew "ruby-build"
brew "rbenv"

# Scala
brew "jenv"
brew "sbt"
cask "adoptopenjdk8"

# Other languages
brew "go"

# fonts
brew "sanemat/font/ricty", args: ["with-powerline"]
cask "font-fira-code"

# Others
cask "1password"
cask "google-japanese-ime"
cask "slack"
cask "docker"
cask "clipy"
cask "alfred"
cask "karabiner-elements"
cask "keepingyouawake"
cask "teensy"
cask "amethyst"
cask "microsoft-office"
cask "appcleaner"
brew "circleci"
